# What is Database?

###### ang DATABASE ay collection ng data stored in a format that can easily be accessed

# What is DBMS?

##### DBMSor Database Management System ay ang ginagamit para e-access ang mga data stored sa ating database.

# May dalawang klase ng DBMS

##### 1. Relational
##### 2. Non- Relational ( No SQL)

# What is Relational database?

##### RELATIONAL DATABASE ay isang klase ng database na kung saan ang mga data na stored sa mga tables ay linked ng relation. Kumbaga table A ay may relasyon sa table B.

##### Madaming mga nagbibigay ng services sa RDBMS (relational DBMS) gaya ng MySQL, SQL server at Oracle

In [3]:
# What is non-relational Database
# Non- Relational Database ay database na walang relation ang data.

# Creating Database

# Selecting data from database

In [8]:
# first e need mo munang select yung data na gusto mo.You can select the database that you want by using the keyword

##### USE name_ng_database ;

In [6]:
#   --> hindi case sensitive ang mga functions ng sql,pero rule of thumb, caps mo mga functions.  
                             # dont forget the semicolon (;) as termination of the line of code

In [4]:
# after mo maselect yung database na gusto mo, you need na to select yung mga database na gusto mo. how? ganito.

##### SELECT customer_id FROM customer  ;

In [9]:
# SELECT is a function then followed by anong column ang gusto mong e-select which is sa example sa taas e customer_is
# FROM is a function na nagsasabi KUNG SAANG TABLE mo kukunin yung data. 

# so ung code sa taas means, Kunin mo yung customer_id na column sa customer na table.

##### SELECT * FROM customer ;

In [10]:
# yung code sa taas means, kunin mo LAHAT (*), * means lahat ng column , sa table na customer.

##### SELECT * FROM customer WHERE customer_id = 1

In [11]:
# Yung code sa taas means, kunin mo lahat ng columns sa table na customer na kung saan ang customer_id ay 1.
# NOTE that the result is depende kung ilang customer ang may ID na 1. pero ID siya so magiging unique siya. so iisang row lang.

##### SELECT * FROM customer WHERE gender = M ORDER BY first_name

In [ ]:
# this means that you select all the columns in customer table in which are males and ORDER/ARRANGE them by the first name
# so magkakaroon ka ng table na naka-arrange yung mga first name alphabitacally na mga lalaki. ;)

#####  NOTE: May tamang syntax or ayos yung mga functions.   Mauuna ang SELECT , then followed by FROM , then susunod ang WHERE , pang last ang ORDER BY.

# SELECT CLAUSE

In [12]:
# ang select clause ay ginagamit para e-select yung mga columns na gusto mo. 
# it is better na name the columns na gusto kasi kung asterisk * ang gagamitin mo
# it will take time and network also para macall yung mga data na gusto mo

##### SELECT firstname, lastname FROM customers

In [14]:
# yung code sa taas ay magseselect ng columns firstname at lastname sa table natin
# sa table na customer

In [ ]:
###### If masyado ng mahaba yung line mo kunwari
###### SELECT firstname, lastname, points,  FROM customers
###### You can break yung mga lines mo. mas readable pa.

##### SELECT  
###### ---->lastname,
###### ---->firstname,
###### ---->points
##### FROM customer

In [15]:
# ----> indention lang yan para mapakita na hindi sila naka align sa SELECT

##### SELECT  
###### ---->lastname,
###### ---->firstname,
###### ---->points
###### ---->points + 10
##### FROM customer

In [16]:
# yung code sa taas, specially yung points + 10, 
# pwede kang magkaroon ng calculations sa mga intergers ang values. 
# yung code sa taas ay mag-a-add ng new column na points + 10 sa OUTPUT na 
# table mo. 

# NOTE: hindi siya magdadagdag ng new column sa TABLE mo sa database mo.

In [17]:
# pwede mo ding palitan yung name ng column na gusto mong output. 
# kunwari yung points+ 10 e gusto mong pangalanan na discounts

# Aliasing  --> function   AS

##### SELECT  
###### ---->lastname,
###### ---->firstname,
###### ---->points
###### ---->points + 10 AS discounts
##### FROM customer

In [18]:
# so sa OUTPUT mo e magkakaroon ng mga columns na

# lastname | firstname | points | discounts |

# DISTINCT

In [19]:
# ginagamit yung code na distinct para e-output ang mga gusto mo na hindi repeated 
# na information sa table mo.

In [20]:
# Example: 
# sa cities na column, may mga customers na same ang cities, kunwari taga San Manuel

##### SELECT DISTINCT cities 
##### FROM customers

# WHERE CLAUSE

In [2]:
# ginagamit ang WHERE clause para e-filter ang mga data. 
# may mga conditions kang dapat gawin. 
# ginagamit yung mga following equality symbols

##### >       greater than
##### >=      greater than or equal to
##### <       lesser than
##### <=      greater than or equal to
##### =       equal to
##### !=      not equal to. 
##### <>      not equal to. same lang sila

In [3]:
# example kung papaano siya gawin or gamitin

##### SELECT *
##### FROM customers
##### WHERE points >200

In [7]:
# Yung code sa taas means that SELECT all ng mga columns 
# FROM (sa) customers na table
# WHERE (na kung saan) ang points ay mas malaki (>) sa 200

In [5]:
# pwede mo ding gawin na ganito

##### SELECT *
##### FROM customers
##### WHERE birth_date > '1990-01-01'

In [6]:
# code sa taas means lahat ng mga customers na pinanganak AFTER (>) 1990-01-01
# year first, then month, then date. if date siya, ilalagay siya sa quotations marks.

# AND , OR and NOT operators

# AND
##### SELECT *
##### FROM customers
##### WHERE birth_date >= '1990-01-01' AND points > 1000

In [8]:
# yung code sa WHERE means that lahat ng may birthdate na equal or after ng 1990-01-01 AND (at saka) may points na 1000
# note na kapag AND gagamitin mo, dapat lahat ng conditions mameet!

# OR
##### SELECT *
##### FROM customers
##### WHERE birth_date >= '1990-01-01' OR points > 1000

In [9]:
# ginagamit ang OR kung atleast isa sa mga conditions ay gusto mong ma meet. 
# atleast isa sa sakanila.

# NOT
##### SELECT *
##### FROM customers
##### WHERE NOT (birth_date > '1990-01-01' OR points > 1000)

In [13]:
# NOT is the negation of the expression or code. 
# so yung code sa taas means yung mga data entry na 
# mayroong HINDI more than 1990-01-01 na birthday 
# AND (at saka) 
# may hindi mas malaki sa 1000 points
# Example

##### NOT > ----  <=
##### NOT < ----  <=
##### NOT = ----  !=
##### NOT >= ----  <
##### NOT <= ----  >
##### NOT OR ----  AND
##### NOT AND ---- OR

# ___ AND ____ OR _____ AND _____ OR___ sinong mauuna?

##### WHERE birth_date >= '1990-01-01' OR points > 1000 AND cities ='baguio'

In [10]:
# NOTE: Mas nauuna ang AND bago ang OR. so sa example sa taas. 
# gagawin niya muna ung points > 1000 AND cities = "baguio"

# IN Clause

In [14]:
#kunware gusto mo ng ganitong code

##### WHERE city = 'baguio' OR city ='urdaneta' OR city = 'tarlac'

In [15]:
# pwede mo sila e-merge lahat ng iyan sa mas maliit na code.

##### WHERE city IN ('baguio', 'urdaneta', 'tarlac')

# BETWEEN Clause

In [16]:
# ginagamit ang BETWEEN na clause pamalit sa sobrang ha na code. 
# kunwari ganito

##### WHERE points >= 1000 AND points <= 3000

In [17]:
# pwede mong gamitin yung function na BETWEEN

##### WHERE points BETWEEN 1000 AND 3000

In [19]:
# NOTE that inclusive yong BETWEEN na function. ibig sabihin nasa range siya ng
# 1000 to 3000 including 1000 and 3000

##### USE sql_store;
##### SELECT *
##### FROM customers
##### WHERE birth_date BETWEEN '1990-01-01' AND '2000-01-01'

In [20]:
# pwede ding gumamit ng date na function

# LIKE Clause and % symbol

In [21]:
# ginagamit ang LIKE clause if you are not certain sa mga kinukuha mo na data. 
# example e want mo na kunin yung mga last name na nagsisimula sa letter "M"

##### WHERE last_name LIKE "m%"

In [23]:
# ang result ng code sa taas ay mga listahan na ang apelyedo ay nagsisimula s M

# Micumao
# Mabon
# Malag

# ung % sa code means any character that follows AFTER ng letter na "m"
# pwede mo ding sabihin na "M"it does not matter if captial letter or small letter yung gagamitin mo
# pwede mo din ilagay yung % sign before the character.

##### WHERE last_name LIKE "%m%"

In [24]:
#ibig sabihin ng code jan sa taas e kahit anong last name basta may m sa gitna. hindi pweding nasa last or unahan

In [26]:
# Other Examples

##### USE sql_store;
##### SELECT *
##### FROM customers
##### WHERE address LIKE "%trail%" OR address LIKE "%avenue%"

# _ underscore sign

##### WHERE last_name LIKE "m_"

In [25]:
# ang ibig sabihin ng code sa taas ay kung saan ang last name mo at 2 (two) chracters lang
# Mi
# Mo
# MM

##### so if "m_ _ _" apat na characters which is M ang start ng letter so pweding Micu ,Mars,

# REGEXP --> Regular Expression

In [27]:
# Ginagamit ang REGEXP kung hindi mo sure yung mga sinirearch mo. Mas maganda siya gamitin kaysa kay LIKE

##### 1.) WHERE last_name LIKE "%m%"
##### 2.) WHERE last_name REGEXP "m"

In [30]:
# yung number 1 code e kapag gagamit ka ng LIKE
# yung number 2 code e kapag gagamitin ka ng REGEXP. 

# tignan ang pagkakaiba. yung LIKE you need % sign. sa REGEXP e hindi na kailangan. 

# same lang sila ng ginagawa ng function na yan. Tinitignan nila sa Database kung sino
# ang may "m" na letter sa name nila. 
# pero sa REGEXP e possible na nasa last at unahan. Still valid parin siya

# ^ Caret Symbol

In [29]:
# ginagamit ang Caret (^) na symnbol para sabihin na it should be this letter or letters
# ang makikita sa harap. 

# NOTE: sa HARAP a. IN FRONT!

##### 1.) WHERE last_name LIKE "m%"
##### 2.) WHERE last_name REGEXP "^m"

In [31]:
# Ibig sabihin ng codes sa taas e mga last names na nagsisimula sa letter M lang.

# $ Dollar Symbol

In [33]:
# Ginagagamit naman ang $ symbol kung ang gusto mong kunin ay
# yung LAST letter/s ng pangalan
# EXample

##### 1.) WHERE last_name LIKE "%m"
##### 2.) WHERE last_name REGEXP "m$"

# | Vertical Bar Symbol

In [34]:
# Ginagamit ang | vertical bar kung gagamit ka ng OR na function. 
# Example

##### 1.) WHERE last_name LIKE "m"  or last_name LIKE "a"
##### 2.) WHERE last_name REGEXP " m | a"

In [35]:
# yung code sa taas ay both ang ginagawa nila. 
# they are taking last names that has letter M or letter A in the name.

In [40]:
# pwede din na

##### WHERE last_name REGEXP " m | a | e"

# [ ] Square brackets Symbol

In [36]:
# Ginagamit ang [] square bracket na symbol if you want to have combinations ng names or leeters
# Example

##### 1.) WHERE last_name LIKE "  a m "  or last_name LIKE " e m " or last_name LIKE " a m "
##### 2.) WHERE last_name REGEXP " [ a , e , i ] m"

In [38]:
# pwede mo din siyang ilagay sa dulo.

##### WHERE last_name REGEXP "  m [ a , e , i ]"

# [ - ] Square brackets Symbol with Hypen

In [42]:
# we are using [ - ]  square brackets with hypen inside to do a range. 

# Example

##### WHERE phone_number REGEXP "  [ 0 - 5  ] 9 $ "

In [47]:
# YUng code sa taas means lahat ng number na may 
# beginning numbers or 0 upto 5 then 9 sa last na digit.

# _ _ _ _ _ _ _ 0 9
# _ _ _ _ _ _ _ 1 9
# _ _ _ _ _ _ _ 3 9
# _ _ _ _ _ _ _ 2 9
# _ _ _ _ _ _ _ 5 9
# _ _ _ _ _ _ _ 4 9

##### WHERE last_name REGEXP "  [ a - c  ] m $ "

In [52]:
# YUng code sa taas means lahat ng last name na may 
# beginning letters na a upto c then m sa last na letter.

# _ _ _ _ a m
# _ _ _ _ b m
# _ _ _ _ c m

# Exercise Test

##### Exercise 1 : Get the customers whose first_names are ELKA and AMBUR
##### Exercise 2 :  last_names end with EY or ON
##### Exercise 3 :  last_names start with MY or contains SE
##### Exercise 4 :  last_names contain B followed by R or U

In [53]:
# USE sql_store;
# SELECT *
# FROM customers
# WHERE first_name REGEXP "ELKA|AMBUR"

In [54]:
# USE sql_store;
# SELECT *
# FROM customers
# WHERE last_name REGEXP "EY$|ON$"

In [55]:
# USE sql_store;
# SELECT *
# FROM customers
# WHERE last_name REGEXP "^MY|SE"

In [56]:
# USE sql_store;
# SELECT *
# FROM customers
# WHERE last_name REGEXP "b[r,u]"

# RIGHT and LEFT function

In [93]:
# RIGHT and LEFT function are used to search information starting from the RIGHT or LEFT character
# Example:

In [96]:
# Table_A

# id_number  #   name   # products
#  123abc    #   John   # aso
#  456def    #   Jhon   # kat
#  313asd    #   Nojh   # dog
#  789qwe    #   onhj   # mew

##### SELECT RIGHT('id_number', 3) AS id_num;
##### FROM Table_A

In [101]:
# Result ng code sa taas. 

# id_num  
#  abc    
#  def    
#  asd    
#  qwe

##### SELECT LEFT('id_number', 3) AS id_num;
##### FROM Table_A

In [100]:
# Result ng code sa taas

# id_num  
#  123    
#  456    
#  313    
#  789

# IS NULL na Operator

In [57]:
# Ginagamit ang IS NULL para hanapin yung mga NULL. 
# NULL means walang laman, no data, walang impormasyon na naka save.

##### WHERE last_name IS NULL

In [58]:
# yung code sa taas means, hanpin mo nga yung mga data natin sa customers table 
# na WALANG lastname.

# ORDER BY  ---> Sorting Data

In [59]:
# ginagamit ito para i-sort yung mga data natin sa database. simple lang siya

##### USE sql_store;
##### SELECT *
##### FROM customers
##### ORDER BY first_name

In [63]:
# maglalabas siya ng table na naka-arrange yung mga first names ALPHABETICALY
# NOTE! this is ASCENDING ORDER

# Arvin
# Budoy
# Canggaro
# Engkanto
# ...
# Zuko

# DESC way of ordering

##### ORDER BY first_name DESC

In [62]:
# yung code sa taas mag-a-arrange ng mga first name na magsisimula sa Z. 

# zuko
# Yemio
# Xayah
# ...
# Arvin

### paano kapag ganito?
### ORDER BY first_name DESC , last_name

In [64]:
# yung code sa taas means, 
# FIRST arrange mo yung mga names into DESCENDING ORDER. 
# THEN, arrange mo sila base sa last name nila in ASCENDING ORDER DIN. 

# ito yung FIRST_NAME sorting
# Zuko Kurimao
# Zaio Cumao
# Yemio
# Xayah
# ...
# Arvin

# LAST_NAME sorting, ito na yung final na result. Take note if anong nagbago sa Z na names
# Zaio Cumao
# Zuko Kurimao
# Yemio
# Xayah
# ...
# Arvin

In [65]:
# USE sql_store;
# SELECT *
# FROM order_items
# WHERE order_id = 2
# ORDER BY quantity * unit_price DESC

# LIMIT CLAUSE

In [66]:
# ginagamit ito if want mong bawasan yung mga gusto mong ipakita na result ng 
# ng kinukuha mong outputs sa database mo. 

# Example

##### SELECT *
##### FROM order_items
##### WHERE order_id = 2
##### LIMIT 3

In [68]:
# Yung code sa taas ay magpapakita lang ng tatlong result sa window mo. 
# Sabihin na nating may 1000 na order_id. It does not matter kahit na 1000 pa
# basta ang ilalabas niya lang ay 3 out of 1000

##### Paano kapag gusto mong kuning e yung pang yung pang 101 to 150?

In [69]:
# Mayroong silang tinatawag na offset. na kung saan, wag niya muna kukunin ganun
# let us say from 1000 na output mo, 
# 101 to 150 ang gusto mong kunin. 

# so ang offset mo ay 100 data tama? yun yung 1-100 na data point na lalaktawan mo
# kasi nga 101 mo gusto magstart. 

# then want mo yung 101 to 150, so ilang data yun? 
# that 50 data tama? 

# so ang code mo ay magiging

##### SELECT *
##### FROM order_items
##### WHERE order_id = 2
##### LIMIT 100 , 50

In [70]:
# doon sa LIMIT na code, yung 100 doon ay yung offset mo
# yung 50 naman e kung ilang data ang ilalabas mo

# JOIN --> combining two TABLES in a database

In [73]:
# May dalawang klase ng JOIN na function

# 1. INNNER JOIN
# 2. OUTER JOIN

# ginagamit ang JOIN kung meron kang gusto e-compare or e-combine

#### Sample Database_A

In [76]:
# TABLE_A

#   Product   |   Price

#      A      |   $ 50
#      B      |   $ 5
#      C      |   $ 10
#      D      |   $ 20
#      E      |   $ 9
#      F      |   $ 3

In [77]:
# TABLE_B

#   Product   |   Unit

#      A      |   1
#      B      |   6
#      C      |   3
#      G      |   2
#      H      |   8

# INNER JOIN

In [80]:
# INNER JOIN means pinagsasamna mo yung dalawang table na yung saan kung anong meron sa table A ay mearon din sa table B
# Example

##### SELECT *
##### FROM TABLE_A
##### JOIN TABLE_B ON TABLE_A.Product = TABLE_B.Product

In [81]:
# yung code sa taas means
# SELECT  * ------> select mo lahat ng columns
# FROM TABLE_A  --> sa table na A
# JOIN TABLE_B ---> we are now joining table a and table b. 
# ON  ------------> ginagamit ang ON na function para mag join ang dalawang table. 
#  Ibig sabihin ng "ON" e magjojoin ang dalawang table sa pamamagitan ng product ng table a at b
# TABLE_A.Product =  TABLE_B.Product means alin sa mga Product ng table a ang parehas sa product ng table b

In [83]:
# ang result ng code sa taas ay:

# TABLE_A

#   Product   |   Price     |    Unit

#      A      |   $ 50      |     1
#      B      |   $ 5       |     6
#      C      |   $ 10      |     3


# NOTE: hindi nasama yung mga ibang products kasi wala naman silang kapareha
# or I mean ka EQUAL (=) sa kabilang table.

# Aliasing

In [84]:
# ginagamit nag aliasing para mas mapadali ang ating code.

##### SELECT *
##### FROM TABLE_A TA
##### JOIN TABLE_B TB ON TA.Product = TB.Product

In [85]:
# so instead na maglalagay tayo ng TABLE_A.Product magiging
# TA.Product nlng siya kasi we set TABLE_A to TA
# same with TABLE_B --> TB

# Joining two separate Databases

In [86]:
# kunwari meron kang dalawang databases. 
# Database_A  --> andito yung mga products
# Database_B  --> andito kung sino mga nag- order

In [87]:
# Database_A

# Product

#  product_id |   price     |    unit

#      A      |   $ 50      |     1
#      B      |   $ 5       |     6
#      C      |   $ 10      |     3
#      D      |   $ 50      |     1
#      E      |   $ 5       |     6
#      F      |   $ 10      |     3

# let us say mayroon tayong anim na products.

In [88]:
# Database_B

# order

#  ordert_id | Product_id  |    Name

#      1      |     A      |     Tim
#      2      |     C      |     Mac
#      3      |     D      |     Kay
#      4      |     E      |     Siya


# let us say mayroon tayong apat na orders by different na customers. hehehe

In [89]:
# If we want to join the two tables, ganito gagawin natin

##### USE Database_A;
##### SELECT p.product_id , price, unit , order_id, name
##### FROM Product p
##### JOIN Database_B.order o
##### ON p.product_id = o.product_id

In [91]:
# USE Database_A; --> ibig sabihin gagamitin natin ung database na A

# SELECT p.product_id , price, unit , order_id, name --> means we are just selecting yung  mga columns na gusto nating ma output. 

# FROM Product p --> so ito naman sinasabi natin na kunin mo ung table na Product tas pangalanan mo na "p"

# JOIN Database_B.order o --> since e-jojoin natin ung dalawang database, kailangan nting e-prefix or idikit kung saan manggagaling yung ibang table natin
                          # --> then followed by the "." point then anong table ang kukunin, then papangalanan natin siya na "o"
    
# ON p.product_id = o.product_id --> so dito, pinagsasama natin ung dalawang table ng dalawang database base ON product_id nila

In [92]:
# Result ng code sa taas. 

#  product_id |   price     |    unit  | ordert_id |   name 

#      A      |   $ 50      |     1    |     1     |  Tim
#      C      |   $ 10      |     3    |     2     |  Mac
#      D      |   $ 50      |     1    |     3     |  Kay
#      E      |   $ 5       |     6    |     4     |  Siya

# SELF JOIN

In [102]:
# ginagamit ang self join kung meron kang gustong pagsamahin 
# na columns mo sa loob ng table mo.

##### SELECT column_name(s)
##### FROM table1 T1, table1 T2
##### WHERE condition;

In [104]:
# first is to select yung mga columns na gusto mong e-print. 
# then from same na table, table1 be T1 at table1 be T2. 
# then anong conditions mo na ipagsasama.

# JOINING Multiple Tables

In [105]:
# if you are going to join multiple tables, magkakroon ka ng madaming JOIN na function din

In [106]:
# Database_A

# Products_Table

#  product_id |   price     |    unit

#      A      |   $ 50      |     1
#      B      |   $ 5       |     6
#      C      |   $ 10      |     3

In [107]:
# Customers_table

#  customer_id |   product  |    ship_id

#      C01     |     A      |     3
#      C02     |     C      |     1
#      C03     |     B      |     2

In [108]:
# Shipment_Table

#  ship_id   |      Status  

#      1     |     On the way    
#      2     |     Shipped    
#      3     |     Not Shipped

In [109]:
# USE Database_A;

# SELECT customer_id,
#        product,
#        unit,
#        price,
#        status
        
# FROM Products_Table pt

# JOIN Customers_table ct
#     ON pt.product_id = ct.products
    
# JOIN Shipment_Table st
#     ON ct.ship_id = st.ship_id

# OUTER JOIN

In [111]:
# may dalawang klase ng OUTER JOIN. 

# 1.) LEFT JOIN
# 2.) RIGHT JOIN

# LEFT JOIN na clause

In [112]:
# Let us say mayroon tayong dalawang tables. 

# TABLE_A

#   Product   |   Price

#      A      |   $ 50
#      B      |   $ 5
#      C      |   $ 10
#      D      |   $ 20
#      E      |   $ 9
#      F      |   $ 3

In [113]:
# TABLE_B

#   Product   |   Unit

#      A      |   1
#      B      |   6
#      C      |   3
#      G      |   2
#      H      |   8

##### SELECT 
##### _ _ _ _ _ta.product, 
##### _ _ _ _ _ta.price, 
##### _ _ _ _ _tb.unit
##### FROM TABLE_A ta
##### LEFT JOIN TABLE_B tb
#####  _ _ _ _ _ON ta.product = tb.product

In [114]:
# ang magiging result niya a

#   Product   |   Price     |    Unit

#      A      |   $ 50      |     1
#      B      |   $ 5       |     6
#      C      |   $ 10      |     3
#      D      |   $ 20      |     null
#      E      |   $ 9       |     null
#      F      |   $ 3       |     null

In [115]:
# Take note if anong nangyari sa table. 
# Sa part ng

#      A      |   $ 50      |     1
#      B      |   $ 5       |     6
#      C      |   $ 10      |     3

# yang result sa taas ay kung saan nag join ang dalawang tables. Table A and Table b both have A, B and C products



#sa baba na result naman e

#      D      |   $ 20      |     null
#      E      |   $ 9       |     null
#      F      |   $ 3       |     null

# Nagkaroon siya ng null kasi hindi nagjoin yung table A at table B sa part na yan 
# KASI yung mga products na DEF ay wala sa table B. 

# Table A mo ay si LEFT kasi FROM Table_A tayo.

##### SELECT 
##### _ _ _ _ _ta.product, 
##### _ _ _ _ _ta.price, 
##### _ _ _ _ _tb.unit
##### FROM TABLE_A ta
##### RIGHT JOIN TABLE_B tb
#####  _ _ _ _ _ON ta.product = tb.product

In [116]:
# ang magiging result niya a

#   Product   |  Unit    |    Price

#      A      |   1      |     $ 50
#      B      |   6      |     $ 5
#      C      |   3      |     $ 10
#      G      |   2      |     null
#      H      |   8      |     null

# USING Clause

In [117]:
# ginagamit ang USING na function kung meron kang PAREHAS na 
# pangalan ng column name sa tables mo. 
# EXAMPLE

# Let us say mayroon tayong dalawang tables. 

# TABLE_A

#   Product   |   Price

#      A      |   $ 50
#      B      |   $ 5
#      C      |   $ 10
#      D      |   $ 20
#      E      |   $ 9
#      F      |   $ 3

# TABLE_B

#   Product   |   Unit

#      A      |   1
#      B      |   6
#      C      |   3
#      G      |   2
#      H      |   8

##### FROM TABLE_A ta
##### LEFT JOIN TABLE_B tb
#####  _ _ _ _ _ON ta.product = tb.product

In [118]:
# sa part ng ON ta.product = tb.product
# pwede mo siyang palitan ng
# USING (product)

##### FROM TABLE_A ta
##### LEFT JOIN TABLE_B tb
#####  _ _ _ _ _USING(product)

In [119]:
# yung code sa taas e same ng result sa taas. pero mas clear ang result.

# UNION na Clause

In [120]:
# Ginagamit ang UNION na Clause if meron kang mga pagsasamahin. na columns 
# either from different tables or same tables. 

#example

# Let us say mayroon tayong dalawang tables. 

# TABLE_A

#   Customer   |   Price

#      D      |   $ 20
#      E      |   $ 9
#      F      |   $ 3

# TABLE_B

#   Shippers   |   Unit

#      A      |   1
#      B      |   6
#      C      |   3
#      G      |   2
#      H      |   8

##### SELECT customer FROM Table_A
##### UNION
##### SELECT shippers FROM Table_B

In [121]:
# ang result ng snippet sa taas ay

#   Customer  

#      D    
#      E     
#      F   
#      A    
#      B    
#      C     
#      G      
#      H     

# TAKE NOTE yung name ng column sa taas. naging CUSTOMER siya kasi yun yung
# naung name natin. if want mo siya palitan pwede ganito sa code. 


# SELECT customer AS Name FROM Table_A
# UNION
# SELECT shippers FROM Table_B


# ang magiging result niya ay

#   Name 

#      D    
#      E     
#      F   
#      A    
#      B    
#      C     
#      G      
#      H

In [1]:
# note that hindi pwede na yung sa first na select mo e dalawang column tas ung ipapasok mo sa union e 
# isang column lang. 

# example

# SELECT customer AS Name, price
# FROM Table_A
# UNION
# SELECT shippers
# FROM Table_B

# sasabihin ng SQL e hindi pwede!

# INSERT INTO --> Inserting Data

In [2]:
# Ginagamit ang INSERT INTO na clause if gusto mo mag insert ng data sa table sa database mo

##### Syntax if papaano ginagamit.

##### INSERT INTO table_name (column1, column2, column3, ...)
##### VALUES (value1, value2, value3, ...);

# VALUES Clause

In [3]:
# Ginagamit ang VALUES na clause para e-list lahat ng values na gusto mong ilagay sa loob ng table mo.

In [4]:
# Example na Database natin

# Products_table

# Product_id  |   Price

#      1      |   $ 1
#      2      |   $ 6
#      3      |   $ 3
#      4      |   $ 2
#      5      |   $ 8

In [5]:
# if gusto mong maginsert ng data sa table mo, ito magiging syntax ng code mo

##### INSERT INTO Products_table (Product_id, Price)
##### VALUES (6 , $ 10);

In [6]:
# Ang magiging result niya ay

# Products_table

# Product_id  |   Price

#      1      |   $ 1
#      2      |   $ 6
#      3      |   $ 3
#      4      |   $ 2
#      5      |   $ 8
#      6      |   $ 10

In [10]:
# may mga time na hindi mo na kailangan maglagay ng id_number sa mga primary key mo
# Why? kasi minsan naka auto-increment na sila. so automatic na syang maglalagay sa database. 

# so pwede mong gawin na ganito yung code mo.

##### INSERT INTO Products_table ( Price)
##### VALUES ( $ 10);

In [ ]:
# Ang magiging result niya ay

# Products_table

# Product_id  |   Price

#      1      |   $ 1
#      2      |   $ 6
#      3      |   $ 3
#      4      |   $ 2
#      5      |   $ 8
#      6      |   $ 10

# huh? same parin? 
# Yup same parin. kasi nakaincrement yung product_id na column sa database natin.

# PKey ---> Primary Key

In [9]:
# ang PKey or Primary Key ay column na kung saan siya yung gagamitin para maaccess
# yung mga information para sa table. 
# Para siyang ID ng isang row ng information. 

# kumbaga sa studyante e may ID_number tayo dba, 
# sa database ng school, ita-type lang nila yung ID number mo 
# Then lalabas na lahat ng information mo like anong name mo, course mo, anong year kana and so on. 
# kadalasan ng mga Pkey e may "id" or "number" sa column name nila like order_id, product_id_student_number_ acount_number ...

# Inserting multiple rows of data

In [12]:
# Let us say may table ka na ganito. 

# product_table

# product_id  |   price  |  name 

#      1      |    1    |  Maysa
#      2      |    6    |  Duwa
#      3      |    3    |  Tallo
#      4      |    2    |  Uppat
#      5      |    8    |  Lima
#      6      |    10   |  innem

# Then want mo mag-add ng 

# product 7, price na 11 tas name na pito
# product 8, price na 21 tas name na walo
# product 9, price na 15 tas name na siam

##### INSERT INTO product_table (price, name)
##### VALUES ("11","pito"),
##### _ _ _ _("21","walo"),
##### _ _ _ _("15","siam")

In [13]:
# Result ng table namin. 

# product_table

# product_id  |   price  |  name 

#      1      |    1    |  Maysa
#      2      |    6    |  Duwa
#      3      |    3    |  Tallo
#      4      |    2    |  Uppat
#      5      |    8    |  Lima
#      6      |    10   |  innem
#      7      |    11   |  pito
#      8      |    21   |  walo
#      9      |    15   |  siam

# Inserting Hierarchical Rows

In [1]:
# kunwari want mong mag insert  ng row na kung saan hindi mo alam yung last na 
# ID na nilagay ng data mo, Pwede mo gamitin ito,

##### LAST_INSESRT_ID ()

# CREATING NEW TABLE

In [2]:
# kung gusto mong gumawa ng new na table sa database mo, ito lang ang gagawin mo

In [3]:
# ganito ang syntax niya

##### CREATE TABLE table_name (
##### -----column1 datatype,
##### -----column2 datatype,
##### -----column3 datatype,
#####   ....
##### );

In [7]:
# Example: Gusto mong gumawa ng new table sa mga customers tas anong binili nila

# so ang magiging code mo ay.

##### CREATE TABLE customers_table (
##### -----customer_id int,
##### -----name varchar(50),
##### -----product_id int,
##### );

In [8]:
# Yung code sa taas means gawa ka ng customers_table, 
# Then sa table na yun, gawa ka ng column na ang name ay customer_id at mga integers lang ang pweding laman
# Then gawa ka ulit ng isa pang column na may name na "name" then ang mga pwede niyang values at varchar at ang limit at 50 characters. varchar is variable characters. maga letters in short.
# then gawa ka ng last na colun na may pangalan na product_id, integer lang ang pwede dito

In [ ]:
# result of the code will be like this. 

# customers_table

# customer_id  |   name |  product_id

In [9]:
# NOw pwede ka ng mag insert ng rows sa data mo.

##### CREATE TABLE customers_table (
##### -----customer_id int,
##### -----name varchar(50),
##### -----product_id int,
##### )
##### INSERT INTO customers_tables(name,product_id)
##### VALUES ("if", 3),
##### ----- ("You", 4),
##### ----- ("see", 1),
##### ----- ("kay", 2)

In [10]:
# ang result ng taas na code ay. 

# customers_table

# customer_id  |   name |  product_id 
#   1          |   if   |      3
#   2          |  you   |      4
#   3          |  see   |      1
#   4          |  kay   |      2

In [5]:
# kunwari want mo ng copy ng table yung table sa baba, ganito gagawin mo

# product_table

# product_id  |   price  |  name 

#      1      |    1    |  Maysa
#      2      |    6    |  Duwa
#      3      |    3    |  Tallo
#      4      |    2    |  Uppat

##### CREATE TABLE copy_p.table AS
##### SELECT *FROM product_table
##### );

In [6]:
# CREATE TABLE ---> means okay, gawa ka ng table. 
# copy_p.table ---> ito yung pangalan ng bagong table
# AS ----> if gagawa ka ng new na table na walang patern, need mo 
#  ------> specify kung ano yung mga column names. sa case natin want nating
# -------> e-copy yung table na product_table
# SELECT * FROM product_table ---> kunin mo LAHAT sa product table.

In [1]:
# ang result ng code sa taas ay,

# copy_p._table

# product_id  |   price  |  name 

#      1      |    1    |  Maysa
#      2      |    6    |  Duwa
#      3      |    3    |  Tallo
#      4      |    2    |  Uppat

# Sub queries

In [3]:
# may mga times na yung mga queries e part ng iba pang queries. 

# kunwari gagawa ka ng table, then from that table kailangan mong kunin yung mga specific na data doon sa table. 

# sa pagkuha mo ng mga info sa table, kailangan mo ng mga queries. hehehe. so nagkakaroon ka ng subqueries.

# UPDATE Clause

In [4]:
# ginagamit ang update clause if meron kang e-update na data sa tables mo

In [5]:
# Syntax

In [6]:
# UPDATE table_name
# SET column1 = value1, column2 = value2, ...
# WHERE condition;

In [7]:
# Example: Kailangan nating palitan yung mga null values natin

# table_a

# product_id  |   price  |  name 

#      1      |    1    |  Maysa
#      2      |    6    |  Duwa
#      3      |    3    |  Tallo
#      4      |    Null |  Nulll

##### UPDATE table_a
##### SET price = 2, name = "Uppat"
##### WHERE product_id = 4

In [8]:
# ito ang magiging result ng code sa taas. 

# table_a

# product_id  |   price  |  name 

#      1      |    1    |  Maysa
#      2      |    6    |  Duwa
#      3      |    3    |  Tallo
#      4      |    2    |  Uppat

# The SQL DELETE Statement
### The DELETE statement is used to delete existing records in a table.

##### DELETE Syntax

#### DELETE FROM table_name WHERE condition;

# The SQL CREATE DATABASE Statement
###### The CREATE DATABASE statement is used to create a new SQL database.

##### Syntax
##### CREATE DATABASE databasename;

# The SQL DROP DATABASE Statement
###### The DROP DATABASE statement is used to delete a SQL database.

##### Syntax
##### DROP DATABASE databasename;